pjpfxq/Infineon_Mcal/Src/Infra_Prod/Sfr/TC33xA_ED/_Reg/IfxSdmmc_regdef.h
/** \brief Response Register 01 */
typedef struct _Ifx_SDMMC_RESP01_Bits
{
    Ifx_UReg_32Bit RESP01:32;         /**< \brief [31:0] Command Response - RESP01 (r) */
} Ifx_SDMMC_RESP01_Bits;

/** \brief Response Register 23 */
typedef struct _Ifx_SDMMC_RESP23_Bits
{
    Ifx_UReg_32Bit RESP23:32;         /**< \brief [31:0] Command Response - RESP23 (r) */
} Ifx_SDMMC_RESP23_Bits;

/** \brief Response Register 45 */
typedef struct _Ifx_SDMMC_RESP45_Bits
{
    Ifx_UReg_32Bit RESP45:32;         /**< \brief [31:0] Command Response - RESP45 (r) */
} Ifx_SDMMC_RESP45_Bits;

/** \brief Response Register 67 */
typedef struct _Ifx_SDMMC_RESP67_Bits
{
    Ifx_UReg_32Bit RESP67:32;         /**< \brief [31:0] Command Response - RESP67 (r) */
} Ifx_SDMMC_RESP67_Bits;

/** \brief SDMA System Address register */
typedef struct _Ifx_SDMMC_SDMASA_Bits
{
    Ifx_UReg_32Bit BLOCKCNT_SDMASA:32;    /**< \brief [31:0] 32-bit Block Count (SDMA System Address) - BLOCKCNT_SDMASA (rw) */
} Ifx_SDMMC_SDMASA_Bits;

/** \brief Slot Interrupt Status Register */
typedef struct _Ifx_SDMMC_SLOT_INTR_STATUS_Bits
{
    Ifx_UReg_16Bit INTR_SLOT:8;       /**< \brief [7:0] Interrupt signal for each Slot - INTR_SLOT (r) */
    Ifx_UReg_16Bit reserved_8:8;      /**< \brief [15:8] \internal Reserved */
} Ifx_SDMMC_SLOT_INTR_STATUS_Bits;

/** \brief Software Reset Register */
typedef struct _Ifx_SDMMC_SW_RST_Bits
{
    Ifx_UReg_8Bit SW_RST_ALL:1;       /**< \brief [0:0] Software Reset For All - SW_RST_ALL (rw) */
    Ifx_UReg_8Bit SW_RST_CMD:1;       /**< \brief [1:1] Software Reset For CMD line - SW_RST_CMD (rw) */
    Ifx_UReg_8Bit SW_RST_DAT:1;       /**< \brief [2:2] Software Reset For DAT line (SD/eMMC Mode only) - SW_RST_DAT (rw) */
    Ifx_UReg_8Bit reserved_3:5;       /**< \brief [7:3] \internal Reserved */
} Ifx_SDMMC_SW_RST_Bits;

/** \brief Timeout Control Register */
typedef struct _Ifx_SDMMC_TOUT_CTRL_Bits
{
    Ifx_UReg_8Bit TOUT_CNT:4;         /**< \brief [3:0] Data Timeout Counter Value. - TOUT_CNT (rw) */
    Ifx_UReg_8Bit reserved_4:4;       /**< \brief [7:4] \internal Reserved */
} Ifx_SDMMC_TOUT_CTRL_Bits;

/** \brief Wakeup Control Register */
typedef struct _Ifx_SDMMC_WUP_CTRL_Bits
{
    Ifx_UReg_8Bit CARD_INT:1;         /**< \brief [0:0] Wakeup Event Enable on Card Interrupt - CARD_INT (rw) */
    Ifx_UReg_8Bit CARD_INSERT:1;      /**< \brief [1:1] Wakeup Event Enable on SD Card Insertion - CARD_INSERT (rw) */
    Ifx_UReg_8Bit CARD_REMOVAL:1;     /**< \brief [2:2] Wakeup Event Enable on SD Card Removal - CARD_REMOVAL (rw) */
    Ifx_UReg_8Bit reserved_3:5;       /**< \brief [7:3] \internal Reserved */
} Ifx_SDMMC_WUP_CTRL_Bits;

/** \brief Transfer Mode register */
typedef struct _Ifx_SDMMC_XFER_MODE_Bits
{
    Ifx_UReg_16Bit DMA_ENABLE:1;      /**< \brief [0:0] DMA Enable - DMA_ENABLE (rw) */
    Ifx_UReg_16Bit BLOCK_COUNT_ENABLE:1;    /**< \brief [1:1] Block Count Enable - BLOCK_COUNT_ENABLE (rw) */
    Ifx_UReg_16Bit AUTO_CMD_ENABLE:2;    /**< \brief [3:2] Auto Command Enable - AUTO_CMD_ENABLE (rw) */
    Ifx_UReg_16Bit DATA_XFER_DIR:1;    /**< \brief [4:4] Data Transfer Direction Select - DATA_XFER_DIR (rw) */
    Ifx_UReg_16Bit MULTI_BLK_SEL:1;    /**< \brief [5:5] Multi/Single Block Select - MULTI_BLK_SEL (rw) */
    Ifx_UReg_16Bit RESP_TYPE:1;       /**< \brief [6:6] Response Type R1/R5 - RESP_TYPE (rw) */
    Ifx_UReg_16Bit RESP_ERR_CHK_ENABLE:1;    /**< \brief [7:7] Response Error Check Enable - RESP_ERR_CHK_ENABLE (rw) */
    Ifx_UReg_16Bit RESP_INT_DISABLE:1;    /**< \brief [8:8] Response Interrupt Disable - RESP_INT_DISABLE (rw) */
    Ifx_UReg_16Bit reserved_9:7;      /**< \brief [15:9] \internal Reserved */
} Ifx_SDMMC_XFER_MODE_Bits;

/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxSfr_sdmmc_Registers_union
 * \{   */
/** \brief Access Enable Register 0   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_SDMMC_ACCEN0_Bits B;          /**< \brief Bitfield access */
} Ifx_SDMMC_ACCEN0;

/** \brief Access Enable Register 1   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_SDMMC_ACCEN1_Bits B;          /**< \brief Bitfield access */
} Ifx_SDMMC_ACCEN1;

/** \brief ADMA Error Status Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_SDMMC_ADMA_ERR_STAT_Bits B;    /**< \brief Bitfield access */
} Ifx_SDMMC_ADMA_ERR_STAT;

/** \brief ADMA3 Integrated Descriptor Address Register - Low   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_SDMMC_ADMA_ID_LOW_Bits B;     /**< \brief Bitfield access */
} Ifx_SDMMC_ADMA_ID_LOW;

/** \brief ADMA System Address Register Low   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_SDMMC_ADMA_SA_LOW_Bits B;     /**< \brief Bitfield access */
} Ifx_SDMMC_ADMA_SA_LOW;

/** \brief Argument register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_SDMMC_ARGUMENT_Bits B;        /**< \brief Bitfield access */
} Ifx_SDMMC_ARGUMENT;

/** \brief Auto CMD Status Register   */
typedef union
{
    Ifx_UReg_16Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_16Bit I;                 /**< \brief Signed access */
    Ifx_SDMMC_AUTO_CMD_STAT_Bits B;    /**< \brief Bitfield access */
} Ifx_SDMMC_AUTO_CMD_STAT;

/** \brief Block Gap Control Register   */
typedef union
{
    Ifx_UReg_8Bit U;                  /**< \brief Unsigned access */
    Ifx_SReg_8Bit I;                  /**< \brief Signed access */
    Ifx_SDMMC_BGAP_CTRL_Bits B;       /**< \brief Bitfield access */
} Ifx_SDMMC_BGAP_CTRL;

/** \brief 16-bit Block Count register   */
typedef union
{
    Ifx_UReg_16Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_16Bit I;                 /**< \brief Signed access */
    Ifx_SDMMC_BLOCKCOUNT_Bits B;      /**< \brief Bitfield access */
} Ifx_SDMMC_BLOCKCOUNT;

